装备：
1. 剑 伤害
2. 手套 暴击率/暴击效果 (*) 10 + 0.5 * 等级；150~250
3. 盔甲 HP (100 + 20 * 小等级) * (大等级 * 0.1 + 1) -- 100 .. 4200
4. 鞋 物理攻击闪躲率 0.5 * 小等级 .../冲刺时候额外获得闪躲 5 * 大等级 闪躲成功后无敌0.3s
5. 项链 魔法攻击力 (*)
6. 戒指 消灭敌人回复HP/地图破坏物回复HP (*) 1~100；1~10
7. 腰带 金币数量/道具几率
8. 头饰 (*)（一周目后获得）增加被击中后的无敌时间/进入地形的无敌时间

卡片
一共36张 6排
前2排1颗星
3, 4排2颗星
5，6排三颗星，且输入需要佩戴的，起始只能佩戴一张，4排卡片中有升级到三张，通关两周目再增加一张

序章教程：
    左右移动
    武器 攻击
    鞋 跳跃
    盔甲 有HP
    下跳
 	特殊键 拾起药水
    腰带 收集金币
    移动视野
    特殊键 进入门 拾起药水>进入门>下跳>超级跳

32 * 32 一个格子，hero宽1格，高1.5格左右，跳跃2.6格子，
静止状态下一行10格，移动时候，增加到15格左右

序章后，来到一个地下城市，有简单的介绍后，出发；
第一次死后，回到城市中，会有人向你解释，教你升级装备；
每次死亡后就会回到主城，会自动被治疗，治疗就会到第二天，因此怪会刷新；
但治疗有时间限制（体力），限制使用完后则不能被治疗

道具系统
一个场景可能会出0-2个，宝箱可能出0-1个
药水不会自动捡起，需要按下键
分两种
1. 15分钟后消失，类似sky force的临时卡（暂不实现）
2. 死亡后消失，各种随机的增益减损效果：
	可重复的：增加血和血上限，增加攻击力，增加暴击，增加暴击伤害，增加闪避，增加金币数量，增加魔法伤害，增加消灭敌人回复HP；增加移动速度，
	不可重复的：重量不会被击飞，冰降低被击中的敌人的速度，关闭陷阱，降低飞行道具速度
	中毒但是大幅度提高伤害，关闭机械

偶尔刷出小boss

第一关：单一路线 地下
第二关：多重路线 工厂
第三关：随机生成 墓穴
第四关：重力颠倒 网络
第五关：没有视野 地狱
第六关：多重路线 城堡

广告
新手礼包 6
双倍金币 12
无限治疗无需升级时间 12
免除广告 12
随机卡片 12
闪烁    30 （暂不实现）替代冲刺，冲刺区域向某方向滑动就会向某方向闪烁，可以无限闪烁无论是否落地，可以跨越障碍，可能会破坏游戏平衡，建议谨慎购买，可以用于通过二周目

长老 制造一个道具，第二天获取
治疗者 治疗
铁匠 升级装备，购买神器
法师 更换卡片
守护者 成就
弓手
盗贼
战士

-------------------------------------------------
流程
起始公司画面后，无需主标题，直接进入游戏，最多有一屏纯文字渲染气氛（真实与虚幻）；
进入教程，主角从地下跟着平台升上来，一路获取各种基本装备，并获得用途介绍；最后再踏上一个平台上升；升到一个房间里，打开门；显示主标题；
新场景：出门后，来到一个地下村落，长老说：英雄欢迎回来，并让你去营救大法师，向右走可以出村；
第一关：出村还是自然的地下，有单一的主路线可以走，会有一些小分支，和一些暂时到不了的地方；
你的第一次死亡时候，会到村里一房间，出来时，治疗者会告诉你，你有一个能力就是不死，在出发地出现，然而一段时间内会虚弱，她可以给你治疗，治疗也需要一天的时间，
    因此无论是死亡还是治疗，怪物都会刷新。出村后你也可以回来接受治疗。同时让你去找到铁匠，了解下升级装备，不去的话不能走出村。

第一关打败boss后，救回法师，法师会给你二段跳卡片，同时可以在他这里查看所拥有的卡片和更换携带卡。
    他会告诉你外面世界已经被恶魔侵占，这里是为数不多的人类据点，来到这里是因为在这里发现了最后一块古代遗迹，
    一共有四个遗迹，里面分别放着世界之石的碎片，其他三个一个还在人类手里，在另外的一个据点保存，
    另两个已经落入恶魔之手，他这次出去已经发现了遗迹的秘密，但还需要时间研究。然后会告诉你村长有任务
    1. 然后村长会给你一个任务，人类发现有一个碎片藏在恶魔的机械工厂，但看守严密，正面军正在佯攻吸引火力，
        而主角跟随盗贼从地下进入工厂关闭电源，然后主力军就可以取得胜利了
    2. 第二天，法师也会给你一个任务，神的图书馆，带回一本书，是对古代遗迹的研究
第二关：与盗贼交谈，他带着你来到工厂，并暗中帮你开启机关，此处地图复杂路线较多，但目的地都是发电空间
    打败

第三关：图书馆

通关工厂后，回到村里，村长说战斗并不成功，恶魔对此早有准备，把碎片转移到了赛博空间，但也不是没有收获，他们获取了进入空间的密码。
    这需要主角再次回到工厂，通过一个地方，使用密码进入赛博空间，盗贼会帮助你，
    但是会提醒你敌人增加了守卫，也就是怪物增强了（实际上每过一关，所有关的怪物都会增强）
    第三关过后会获得蓄力炮，这时候法师会告诉你增强魔法攻击的方法，一个是第一关拿到一个项链，一个是图书馆拿到魔法增强的卡片

第四关：赛博空间，只要到过这里，下次再和盗贼交谈就可以选择去工厂还是去赛博空间，这里通过触碰机关可以改变自己和怪物的重力

额外关：赛博空间后，可以与盗贼pk（获得钱），然后与守护者pk（手套），然后与长老pk（获得某个卡片）

取得图书馆的书后，如果村长的任务没有完成，他会让你去完成，否则在第二天，他会研究出如何进入遗迹
    入口在第一关boss的房间，因此要重新打，法师会提醒你因为遗迹的力量怪物在增强（实际上每过一关，所有关的怪物都会增强）

第五关：古代遗迹

第六关：城堡

第一周目：击败最终boss后，boss会透露认识主角的感觉，并且并没有想到主角能够击败他，所以他不得不使用那个技能，尽管知道主角有一定的免疫力，
    于是在boss脚下出现了进度条，并最后回到了游戏一开始。

第二周目：你保留记忆又回到了开始，你会保留卡片，
    由于你已经获得了二段跳，就会法师后，法师会给你头饰，可获得更多的无敌时间，可用于过二周目（如果不断刷的话）和踩墙跳；
    工厂作战会失败，但你已经知道了碎片在赛博空间也知道密码；
    去图书馆前，法师会告诉你里面有增加飞行能力的卡片，于是在图书馆有个特殊的空间，完成任务后得到“踩墙跳”
    其实每一关通过后能打第二次，但一直没有提示，但此时长老会告诉你，打完第二次boss后可以获得一种道具的制作方法，你可以在长老这里选择
    长老会在第二天完成；而赛博空间的boss可以获得道具：机械停止，这个会让你在跳台时更困难，但却是二周目的关键
    boss会说竟然又被你击败，好在那招还好用，如果你获得了超级跳，关闭了机械；或者学了闪烁，或者获得了超级跳并把头饰升级到了很高的等级
    可以在loading技能成功前击中boss，直接渐黑进入结束动画：会告诉你人类在你的帮助下击败了恶魔取得了胜利，而你也会被后人传颂；
    然后又回到了场景中，你可以出发boss尸体，选择是否loading进入第三周目；
    主角会获得一个背包格子

第三周目：和二周目几乎一样，法师会给你大量的钱；
    boss会说竟然又被你击败，好在那招还好用，如果这次你能击中boss，boss会消失，从另一边出来了真正的boss，原来你击中的那个是替身，
    boss说你利用他的能力回到过去，就是给他机会了解事情的来龙去脉，说其实你们是兄弟，而在你们兄弟对抗邪恶法师并即将取得最终胜利的时候，你被法师控制
    并说这次重生他寻找到了真实之眼，然后你会发现boss并不是骷髅的样子，你一路击败的怪物都是人类士兵，
    他说你可以选择相信他或者不信，你若不信就回到另一边杀了他，否则给你准备了传送器回去看看你的长老吧，boss不能和你一起去是因为有结界
    你回去后发现长老和村里的样子都变成了邪恶巫师，长老还在惊奇你为何回来，你可以选择击杀他，选择后，和长老以及其他村民战斗；
    击败后，进入结束动画；会告诉你，世界本来和平，但是来了邪恶巫师，在危难关头，你和boss都受到了神的祝福，一个可以拥有了穿越时间的机器，另一个拥有了不死之身；
    但主角后来被邪恶巫师控制差一点就让巫师取得胜利，最后boss使用真实之眼让你恢复了神智，并取得胜利
    然后又回到了场景，可以利用传送器再回去，你依然可以选择杀死boss（因为只有这样才能下一周目），但这次boss会变得更强，
    击败后会进入另一个结束动画，是说邪恶国王利用机械毁坏自然，有个法师出来反抗，国王的两个儿子一个帮助国王，而另一个就是主角，帮助法师，在法师死后，主角继承了法师的衣钵
    击败了已经继位的boss，为大自然取得了胜利。然后会场景，可以进入下一周目

第四周目：和第三周目基本一样，只是最后回到boss那里时，boss会说我知道你是来杀我的

********
二段跳
踩墙跳
冲刺
踩踏
金币吸附
地图显示敌人
击退状态下，可以通过跳来移除击退状态，只要跳的数量还有
第一次落水，可水上行走0.5s
每物理攻击命中一个怪物，可给下一次命中的魔法进行增幅，伤害为300%，可储存20次
每物理攻击命中一个可破坏物，可给下一次命中的魔法进行增幅，伤害为300%，可储存20次
更换音乐魔法增幅直接到20层
减少施法间隔（蓄力炮，跟踪弹，直线炮，分身）


保留效果
Boss减速
满血增加伤害
接近死亡增加暴击率和效果
道具回血效果 10%->15%->20%
多获得一个格子
嘴炮 降低升级花费 5%
额外获得hp 150
额外获得物理攻击力
额外获得法术攻击力
HP小于30%的敌人造成额外15->30%的伤害
伤害减少5->10%


剑气
蓄力炮
火圈
小蜜蜂跟踪弹
濒死回血 免疫致命伤并在10秒内回复30/45/60%HP
尸体爆炸
跳跃十字闪电
荆棘 碰撞和踩踏敌人受伤
跟随小飞机 直线炮
实力的证明 增加伤害移速减少运气
缩小
每隔几秒留下一个分身可伤害敌人

********
机械停止+踩踏，无敌时间+跳跃恢复
降低重力，踩墙跳


********
-- 金币数加分隔符
let n: number = 123456789;
let s: string = (n || 0).toString().replace(/(\d)(?=(?:\d{3})+$)/g, '$1,');
cc.log("osize", s);

根据dpi适配滑动距离，可能只在手机使用
适配大于16/9比例，让上下ui往中间移动一些

捡拾道具的动效类似盗贼遗产，但不显示数值
主角不会游泳，到水里会一击必杀
更换音乐的时候会显示场景名称和音乐名称












