装备：
1. 剑 伤害
2. 手套 暴击率 *
3. 盔甲 HP
4. 鞋 闪躲率，跳跃和冲刺时候加倍
5. 项链 魔法攻击力 *
6. 戒指 消灭敌人回复HP *
7. 腰带 金币数量
8. 头饰 （一周目后获得）

卡片
一共36张 6排
前2排1颗星
3, 4排2颗星
5，6排三颗星，且输入需要佩戴的，起始只能佩戴一张，4排卡片中有升级到三张，通关两周目再增加一张

序章教程：
    左右移动
    武器 攻击
    鞋 跳跃
    盔甲 有HP
    下跳
 	下滑 拾起药水
    腰带 收集金币
    移动视野
    下滑 进入门 拾起药水>进入门>下跳

32 * 32 一个格子，hero宽1格，高1.5格左右，跳跃2.5格子，
静止状态下一行10格，移动时候，增加到15格左右

序章后，来到一个地下城市，有简单的介绍后，出发；
第一次死后，回到城市中，会有人向你解释，教你升级装备；
每次死亡后就会回到主城，会自动被治疗，治疗就会到第二天，因此怪会刷新；
但治疗有时间限制（体力），限制使用完后则不能被治疗

清理一个场景后会显示一个隐藏的宝箱，会有钱和药水

道具系统
一个场景可能会出0-2个，宝箱可能出0-1个
药水不会自动捡起，需要按下键
分两种
1. 15分钟后消失，类似sky force的临时卡（暂不实现）
2. 死亡后消失，各种随机的增益减损效果：
	可重复的：增加血和血上限，增加攻击力，增加暴击，增加暴击伤害，增加闪避，增加金币数量，增加魔法伤害，增加消灭敌人回复HP；增加移动速度，
	不可重复的：重量不会被击飞，冰降低被击中的敌人的速度，关闭陷阱，降低飞行道具速度
	中毒但是大幅度提高伤害，关闭机械

第一关：单一路线 地下
第二关：多重路线 工厂
第三关：随机生成 墓穴
第四关：重力颠倒 网络
第五关：没有视野 地狱









