职业系统
不同职业下能获取不同的技能，如制作东西，更高的属性上限，还能记住特殊位置，转生后就可以不用重复做任务。
转生后能记住上次职业的技能，而这次又可以成为新的职业。
有的技能是有等级的

	<位>小镇
			获得开垦田地的能力，并可以种植基本作物
			获得制造炊具的能力，并可以制作2格食材
			裁缝：增加背包（8次）
	护卫队
			获得制作武器台的能力，并可以制作基础武器
			获得制作防具台的能力，并可以制作基础防具
			获得制作魔法台的能力，可以制作基础魔法物品
			<优>领取津贴
	盗贼
			减少地图移动消耗的时间和体力30%
			战斗逃跑的成功率增加10%
			获得酿酒的能力
			增加战斗和拾荒获得的物品30%
			<弊>不再能进入镇子
			<优>最终会获取武器“血刀”可以按照百分比减少敌人血量，适用于对“生命守护者”的战斗
	矿工
			采集消耗的时间和体力减少20%
			体力增加20（5级）
			食物和水的上限增加10（5级）
	法师
			获得制作炼金台的能力，并可以基础炼金
			抗寒冷（火焰护体）
	<转>黑魔法师
			魔法武器伤害增加30%（3级）<需要龙精华（杀龙获得，所以屠龙者的buff很有用）>
			制作高级魔法武器
	<转>白魔法师
			精神上限增加20（5级）
			制作高级魔法防具
	食人魔
			战斗后恢复20%生命
	<转>食人魔厨师
			制作3格食材
			抗炎热（散热）
	<转>食人魔战士
			生命上限增加20（5级）<需要酒（杀盗贼少量获得，或学习酿酒后自己制作）>
	牧师
			减少伤害10%（3级）
			食品药品的效果增加10%（3级）
			高级炼金
	商人
			增加一格背包（4级）
			提高卖东西的价格
			可以在家中建造商行，买卖就无需再去镇里了
	游侠
			增加射程（5级）
			制作高级防具
	<转>赏金猎人
			远程武器伤害增加30%（3级）
			制作高级远程武器
	<转>刺客
			战斗第一回合伤害增加30%（3级）
	<转>狂战士
			近战武器伤害增加30%（3级）
			制作高级近战武器
	屠龙者
			对龙的伤害增加100%
			<弊>随身携带屠龙者四件装备（屠龙剑，龙鳞甲，龙鳞鞋，龙盔，除了基本功能，分别对龙的伤害提高50%）不能丢弃和存入箱子（据说需要屠龙者的力量才能保存装备）
	精灵王
			减少建筑和升级的材料消耗30%（自然给予）
			减少建筑和建筑升级的时间和体力消耗30%（自然之力）<必须在第一个春天前完成>
			水井增幅（每个等级水量+1）
			对水和食物的消耗降低50%（光合作用）
			对boss伤害增加100%（自然平衡）
			<弊>不能砍伐树木


最终还是要各种打怪，怪物有属性之分，需要用不同的武器和装备才能有效克制，所以最终比拼的就是包的大小。
地点层次更深，去一个地方可能需要经过几个地方才能到达

这是一个关于末日的故事，每次轮回随着时间推移，天气会越发恶略，怪物会越发疯狂，各种产出会慢慢减少。
而你就是救世主，需要在轮回里修复这个世界。
五大支柱：火，水，风，大地，生命，你要在每次轮回里完成支柱的修复，击败已经疯狂的守护者。而每击败一个守护者，下次转生后，他会把能力给予其他活着的守护者。
当然一开始你是不知道的，直到你第一次进入神庙，打败守卫，获得圣杯，圣杯才告诉你这个消息，并且圣杯也是你转生的工具

体力对于战斗是个很重要的资源，一般回复体力就是睡觉，可以打造在野外可以用的睡袋和帐篷，但都不能在战斗中用，
战斗中每次进攻和使用道具都会消耗一点体力，使用武器不再额外消耗体力，随着战斗消耗时间还会额外减少体力
只有一种稀有的可以恢复所有状态的药可以在战斗中恢复体力
所以就算你带了很多的药，没有体力，还是无法在战斗中获胜

夏天会消耗更多的水
到夜里会降低打怪和搜索的收益，会降低战斗伤害
有的物品的采集会标记出遇敌，采集后有几率刷出怪物，击败后才能获得物品
所有的采集，战斗，拾荒，在获取物品画面都可以先不拾取而是重复这次活动，直到不想继续一次全部获取，如果忘了拾取而直接退出，只要不退出地图就会一直保存状态


床 默认
箱子 默认
制作台 默认
武器台
科研台 <取消> 建筑自己升级自己，其他东西在其他镇子上找
防具台
秘术台
炼金台
炊具
农田
酿酒桶
井 默认
卫生间 默认
商会

