这是一个游戏，但表面上看像一个阅读类的应用。画面非常简单，除了每章标题插图和每章最后可以有插图，余下在主页面不会有任何的图，插图的颜色是单一的，并且有大小限制。刚开始玩，就像在看一部小说，但是随着故事发展，你作为主人公却越来越能影响故事的走向，所以这个游戏才叫做《你的世界》。后期还能自己编故事让别人来玩，同时挣钱。你读别人的故事，也可以帮他修改，被接受后也可以分成。还能同时和一起看故事的人聊天，或大家配合一起影响故事走向。

[[剧情]]
你可以是学生，毕业不久的年轻人，小有成绩的30岁左右年轻人，可男可女，你来到一家神秘的公司面试，结果顺利通过。进入之后，各种奇怪事情发生，而你也发现你突然有了神奇的能力，时间倒流。最终发现，这里是一个政府部门，叫做国际时光局。因为科学家发现了平行世界，并且对本世界产生了影响。同时发现了有一群人，有能力在平行世界穿梭，并且掌握了时间的控制力。而你就是其中一个。在这里，你需要得到锻炼，并且去各个时空完成任务。

每进入一个时空，就进入了一个故事里，故事里会根据你选择的解决方式和对话影响后面的走向。对于选择了不同的性别和岁数可能剧情有所变化。不同的[技能]，也会产生额外的选项。[技能]等级高低影响选项成功的概率。

到了一定的程度，你会被一群称为“深井”的人联系到，他们是另一群了解平行世界的人，但却是政府，也就是国际时光局的对立者。他们会邀请你加入。这时候你就要选择到底帮助哪一边。

时光局里面也分成多个组织，时光一局，二局，三局等等，其中最有势力的是时光一局的B大队。
深井中，也有个最强组织，大家管里面的人称之为猴子。

当然在故事里，这种跨越时空你并不会真正过去，而是你的思维和那个世界的某个思维产生量子纠缠，通过超光速的量子传态控制那边进行故事。这种联系也有可能中断，比如你断网的时候。

[[血和魔]]
每个时空里你会有选择解决方式的时候，如果你觉得选择有误，你可以利用自己的时间回溯能力，返回之前的时间。但是时间追溯能力消耗能量，每个人能量有限，可通过升级等方式获得更高的上限。

你也会有个血量槽，故事过程中会不慎减少，如果减少为0则会死亡，但也只是必须重新进入这个故事中。当然你也可以使用时间回溯到之前的选择上。升级会增加血量。

[[技能]]
除了时空方向的能力，你们这些人每人还有特殊能力，分4个方向，分别是体术师，操控者，学者和魔导士。
-- 每个方向有十个技能。技能有20级。但是很难升级到最高级。一般10级以上需要的经验值指数级上涨。然后还有转职。额外获得5个技能中的两个。所以一共会有60个技能，每个职业15个。但60个技能可能有能力上重复的，最终大概会有50种不同的能力。
-- 还有4个公共技能：也就是最终每人有16个技能。

11.17更：
每个职业的能力分成多个层次，初级，中级，高级，以后可能还有特级，专家，大师等等。技能分成主动和被动，被动所有职业都一样。
初级是2个主动，4个被动。被动分别是：勇气，信任，思想，幸运，分别影响最大血量，自己和队友的血魔，最大魔法，其他概率。
中级是3个主动，2个被动。高级是3个主动，2个被动。
也就是一共32个技能。8个被动。

时空也是分等级的。初级时空里面只能用初级技能。中高级都可以用同等级和低等级的。这样一方面也是为了[创作]的方便。
每个技能最多有20级，10级以后经验指数级上涨。每次只能指定一个技能进行学习，只有一个技能升级到10级时，才能学习另外的技能。只有学习到10级两个初级技能才能学中级，高级同理。
[[这样做的好处是：高等级玩家意味着技能更多选择更多，而不是技能成功率更高]]
技能升级时，血魔也会有所增加，但想增加到一个较高的程度，还是要靠被动技能。


[[会员]]
点券：充值会有点券，点券也能在收取手续费后兑换成钱，点券可以用于购买会员，道具什么的

非会员：保持2个记录。
普通：无上广告，下广告不用输入。可以缓存故事。保持5个记录。提高点评价值   20每月 198每年
超级：没有下广告（直接转换成经验）。3倍经验。保持20个记录。提高点评价值   200每月 1880每年 2580每两年（3.5每天）
心悦：6倍经验。3倍血魔。保持100个记录。提高点评价值                   2000每月 18800每年 25800每两年 35800每5年（19.6每天）

[[物品]]
完成平行世界任务会有奖励：各种不同的经验值，收集品，只可以用点券购买的物品

每个故事里面都会有一些收集品，大约最多10个，官方认可更好的故事收集品越多，等你回来后，有类似收集库的地方，里面东西越多就可以随着时间产生更多的经验值什么的。有的收集品会影响其他的故事。
收集品每个每人只能拥有1个，但是也可以交易出去。

物品：只有点券可以兑换的物品，比如回血回蓝的增强实力的等，但是每次故事使用数量是有限制的

[[创作]]
在等到了一定的程度后，你们有了自己挖掘（生成）平行世界的能力，你可以创建世界等待别人来完成。每有人进入你的世界，在里面消耗时间，你会获得你们组织对你的奖励，甚至包括点券。
当你进入了别人的世界后，可以帮助这个人来提高这个世界的完成度。在编辑模式下，故事的每个段落后面可以添加评论。写故事的人有要求要采纳建议或者反驳，如果建议被采纳那么提出建议的人在写故事人获得收益时自己也能获得一小份。也可以再每章节后追加下面的故事（但是这个怎么和原故事作者合作还没想好）。

不同的平行世界有不同的类型，有些类型是故事作者自己选择的，有些是写好以后根据故事系统评估出的：是否可以使用特殊技能；是否需要合作

[[游戏]]
有脚本写的小游戏，用于解密
cocos2d-x-js-lite

[[广告]]
上面有导航栏广告，盖住导航栏，左边是详情按钮进入一个webView，右边是一个叉子。进入故事后出来，取消后大约10分钟后再次出来
每章结束底部有广告，点击输入要输入的内容可以获得奖励。
可以有赠送的物品，是某种真实商品。

------------------------------------
[[设计]]
主页在最左边，第二个是一个聊天页面，可以和朋友和同在一个故事里的人聊天，组队，交易。



