你可以是学生，毕业不久的年轻人，小有成绩的30岁左右年轻人，可男可女，你来到一家神秘的公司面试，结果顺利通过。进入之后，各种奇怪事情发生，而你也发现你突然有了神奇的能力，时间倒流。最终发现，这里是一个政府部门，叫做国际时光局。因为科学家发现了平行世界，并且对本世界产生了影响。同时发现了有一群人，有能力在平行世界穿梭，并且掌握了时间的控制力。而你就是其中一个。在这里，你需要得到锻炼，并且去各个时空完成任务。

除了时空方向的能力，你们这些人每人还有特殊能力，分4个方向，分别是体术师，操控者，学者和魔导士。每个方向有十个技能。技能有20级。但是很难升级到最高级。一般10级以上需要的经验值指数级上涨。然后还有转职。额外获得5个技能中的两个。所以一共会有60个技能，每个职业15个。但60个技能可能有能力上重复的，最终大概会有50种不同的能力。

每进入一个时空，就进入了一个故事里，故事里会根据你选择的解决方式和对话影响后面的走向。如果你觉得选择有误，你可以利用自己的时间回溯能力，返回之前的时间。但是时间追溯能力消耗能量，每个人能量有限，可通过升级等方式获得更高的上限。对于选择了不同的性别和岁数可能剧情有所变化。不同的特殊能力，也会产生额外的选项。技能等级高低影响选项成功的概率。

你也会有个血量槽，故事过程中会不慎减少，如果减少为0则会死亡，但也只是必须重新进入这个故事中。当然你也可以使用时间回溯到之前的选择上。升级会增加血量。

到了一定的程度，你会被一群称为“深井”的人联系到，他们是另一群了解平行世界的人，但却是政府，也就是国际时光局的对立者。他们会邀请你加入。这时候你就要选择到底帮助哪一边。

时光局里面也分成多个组织，时光一局，二局，三局等等，其中最有势力的是时光一局的B大队。
深井中，也有个最强组织，大家管里面的人称之为猴子。

点券：充值会有点券，点券也能在收取手续费后兑换成钱，点券可以用于购买会员，道具什么的

在等到了一定的程度后，你们有了自己挖掘（生成）平行世界的能力，你可以创建世界等待别人来完成。每有人进入你的世界，在里面消耗时间，你会获得你们组织对你的奖励，甚至包括点券。

物品：

完成平行世界任务会有奖励：----

有脚本写的小游戏，用于解密

不同的平行世界有不同的类型，有些类型是故事作者自己选择的，有些是写好以后根据故事系统评估出的：是否可以使用特殊技能；是否需要合作

每个故事里面都会有一些收集品，等你回来后，有类似收集库的地方，里面东西越多就可以随着时间产生更多的经验值什么的。

标准战斗：



